Revit 2027 API
IFCAnyHandle.SetAttribute(String, IList<IFCAnyHandle>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAttribute(
	string name,
	IList<IFCAnyHandle> values
)
Public Sub SetAttribute (
	name As String,
	values As IList(Of IFCAnyHandle)
)
public:
void SetAttribute(
	String^ name,
	IList<IFCAnyHandle^>^ values
)
member SetAttribute :
        name : string *
        values : IList<IFCAnyHandle> -> unit
Parameters
name String
values IList<IFCAnyHandle>
See Also
Reference
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace